//напишите программу, которая на вход
//принимает число и выдат его квадрат (число)
//умноженнное на само себя).

Console.Write("введите целое число ->");
int num = int.Parse(Console.ReadLine());
int numResult =num * num;
Console.Write("Квадрат числа равен ->");
Console.WriteLine(numResult);
Console.ReadKey();

